# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'heroku/brew'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'heroku'
brew 'wget'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'python'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'nvm'
brew 'heroku'

# Apps
cask '1password'
cask 'aerial'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'skype'
cask 'tor-browser'
cask 'joplin'
cask 'dropbox'
cask 'spotify'
cask 'keepassxc'
cask 'alfred'
cask 'notion'
cask 'the-unarchiver'
cask 'vlc'
cask 'handbrake'
cask 'iterm2'
cask 'sublime-text'
cask 'vagrant'
cask 'sequel-pro'
cask 'tableplus'
cask 'cyberduck'
cask 'phpstorm'
cask 'dash3'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'transmission'
cask 'paw'
cask 'visual-studio-code'
cask 'signal'
cask 'slack'
cask 'netnewswire'
cask 'hubstaff'
cask 'bettertouchtool'
cask 'inkscape'
cask 'calibre'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'


# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'NordVPN IKE - Unlimited VPN', id: 1116599239
mas 'Coderunner 3', id: 955297617
mas 'Lightshot Screenshot', id: 526298438
